{
    "events": [
      "Short Term Course on, “Modeling and Simulation of Gas Fired Furnaces in Steel Industry” SAIL Bokaro, 15-30th Nov. 2021.",
      "Delivered Lecture on, “Mechanics Based Material Modelling and Analysis of Structure and Structural Components-An Overview”, ATAL Sponsored Online Faculty Development Program (FDP) on “Advances in Novel Composite Materials: Fabrication, Analysis and Optimization” 8th September 2021.",
      "Delivered Lecture on, “Material Mechanics Simulation and Modelling-An Overview”, TEQIP-II SPONSORED STTP at NIT Karnataka “Advances in Computational Mechanics for Engineering Applications (ACMEA-2021)” 1st-5th February 2021.",
      "Delivered Lecture on, “Mechanics Based Multiscale Modelling and Analysis of Uniform/Graded/Hybrid Structure-An Overview”, AICTE SPONSORED STTP at C. V. Raman Global University on “Processing, Characterisation and Modelling of Smart Material and System” 18th-23rd January 2021.",
      "Delivered Lecture on, “Mechanics Based Materials Modelling and Importance in Mechanical Engineering Design”, TEQIP-III SPONSORED STTP at Government Engineering College Keonjhar October 2020.",
      "Delivered Lecture on, “Numerical/Simulation Modelling of Graded Structure: Material Model Perspective”, TEQIP-III SPONSORED FDP at VSSUT Burla on “Product Manufacturing and Analysis: Inculcation of Newer Methodologies (PMAINM-2020)” 9th-13th September 2020.",
      "Delivered Lecture on, “Fundamental Approach for Mechanics Based Modelling Simulation and Experimentation (Nano to Macro): An Overview”, TEQIP-III SPONSORED FDP at Government Engineering College Kalahandi August 2020.",
      "Delivered Lecture on, “Multiscale Materials Modelling: Fundamental and Applications”, FDP at Malla Reddy College of Engineering and Technology on Emerging Technologies in Structural and Fluid Modelling and Analysis July-August 2020.",
      "Deliver a lecture on, “Importance of Modelling and Analysis in Mechanical Engineering”, TEQIP-III, BPUT sponsored    FDP on “Advances in Mechanical Engineering” AME-2020 11th-15th February (14.02.2020).",
      "Deliver a lecture on, “Modelling-Analysis of Fibre-reinforced Composite and Optimisation of Structural Responses”, Advanced Techniques for Characterization and Optimization of Mechanical System (ATCOMS-2019) VSSUT Burla, April 2nd-6th 2019.",
      "Deliver a lecture on, “Introduction to Smart /Functional Materials and their Applications”, Recent Innovations and Developments in Futuristic Materials NIT Jamshedpur, December 17th-21st 2018.",
      "Deliver a lecture on, “Nonlinear Structural Modeling and Analysis”, GIAN Course NIT Rourkela, October 1st-5th 2018.",
      "Deliver lecture on, “Modeling and Simulation of CNT/Delamination/Functional Material with Experimental Step”, VSSUT Burla 23rd-28th April 2018",
      "Deliver lecture on, “Modeling and Analysis of CNT Reinforced Composite Structure (Nano/Micro to Macro Scale)”, Institute of Engineers 20th April 2018, Rourkela Local Centre.",
      "Delivered a lecture on, “Introduction to FEM and implementation in Composite Analysis”, VSSUT Burla 19th-24th February 2018",
      "Short Term Course on Applied Mathematics and Mechanics of Composite and Functional Materials: 15st-17th December 2016 NIT Rourkela.",
      "Delivered a lecture on, “Vibro-Acoustic Behaviour Laminated Structure”, EAACM-2016, NIT Rourkela Bhubaneswar 6th October 2016.",
      "Short Term Course on COMPOSITE MATERIAL PROCESSING ANALYSIS AND OPTIMISATION: 21st-24th June 2016 NIT Rourkela.",
      "Co-Convenor in National Symposium on Rotor Dynamics (NSRD-2016) 7th-9th January 2016 NIT Rourkela.",
      "Delivered a lecture on, “Free Vibration Behaviour of Carbon Nanotube Reinforced Composite Plate under Thermal Environment”, KIIT University Bhubaneswar 3rd October 2015",
      "Delivered a lecture on “How to Choose Research Problem” Department of Mechanical Engineering, NIT Rourkela, Odisha, April 2015.",
      "Mechanics Based Design of Materials and Structures MITS Raygada 23rd March 2013 of Basant Utsav.",
      "Introduction to Vibration in VABRAM NIT Rourkela 21-22 October 2013",
      "Geometric Nonlinear Vibration Analysis of Heated Laminated Cylindrical Panel,  ACUN6 –Composites and Nanocomposites in Civil, Offshore and Mining Infrastructure Melbourne 14 – 16 November 2012",
      "Vibration of thermally post-buckled composite panels with and without  SMA fibres Workshop on Modelling and Analysis of Dynamic System, NIT Rourkela 6th December 2011"
    ]
  }