[
    "Kumar V, Kumar EK, Pattanayak P, Panda SK, (2023), Modelling and Analysis of Metal-Fibre Laminated Composite: An Experimental Verification, IOP Conference Series Proceedings, IMMT 2023.",
  "Kumar EK, Kumar V, Pal A and Panda SK, (2023), Enhancement of Structural Strength and Stiffness of Laminated Composites Bonded with Smart Material (SMA: Shape Memory Alloy)- A Simulation Study, IOP Conference Series Proceedings, IMMT 2023.",
  "Kumar A, Kumar V, Kumar EK, and Panda SK, (2023), Modal Analysis of Damaged Fibre Metal Laminated Structure, IOP Conference Series Proceedings, IMMT 2023.",
  "Kumar V, Panda B, Kumar EK, Panda SK, (2023), Nonlinear Bending Analysis of Damaged Metal-Fibre Laminated Composite: An Experimental Verification, Materials Today: Proceedings, ICPCM 2023.",
  "Pal, A, Kumar EK, Kumar V, and Panda SK, (2023), Smart Material Integration in Laminated Composites: A Comprehensive Study on Structural Stabiliy and Stiffness Enhancement using Shape Memory Alloys, Materials Today: Proceedings, ICPCM 2023.",
  "Mahapatra, T. K., Satapathy, S. and Panda, S. K. (2022) Thermal and acoustic properties evaluation of waste tire and textile reinforced epoxy composites 62 (10) 5982-5986 doi: org/10.1016/j.matpr.2022.04.962",
  "Dash, S., Sharma, N., Mahapatra, T. R., Panda, S. K. and Sahu, P. (2018) Free vibration analysis of functionally graded sandwich flat panel, IOP Conf. Series: Materials Science and Engineering 377 (2018) 012140 doi:10.1088/1757-899X/377/1/012140.",
  "Sharma, N., Mahapatra, T. R. and Panda, S. K. (2018), Analysis of vibro-acoustic response of un-baffled laminated composite conical shell panel with varying thickness, IOP Conf. Series: Materials Science and Engineering 377 (2018) 012139 doi:10.1088/1757-899X/377/1/012139",
  "Mehar, K. and Panda, S. K., Dynamic Response of Functionally Graded Carbon Nanotube Reinforced Sandwich Plate, NCPCM-2017, 8th-10th December, NIT Rourkela, Odisha, IOP Conf. Series: Materials Science and Engineering 338 (2018) 012017 doi:10.1088/1757-899X/338/1/012017",
  "Hirwani, C. K., Biswas, S., Mehar, K. and Panda, S. K., Numerical Flexural Strength Analysis of Thermally Stressed Delaminated Composite Structure under Sinusoidal Loading, NCPCM-2017, 8th-10th December, NIT Rourkela, Odisha, IOP Conf. Series: Materials Science and Engineering 338 (2018) 012019 doi:10.1088/1757-899X/338/1/012019",
    "Sharma, N., Mahapatra, T. R., Panda, S. K. and Sahu, P., Characterization of the Acoustic Radiation Properties of Laminated and Sandwich Composite Panels in Thermal Environment, NCPCM-2017, 8th-10th December, NIT Rourkela, Odisha, India. IOP Conf. Series: Materials Science and Engineering 338 (2018) 012031 doi:10.1088/1757-899X/338/1/012031",
    "Katariya, P. V., Das, A. and Panda, S. K., Buckling analysis of SMA bonded sandwich structure – using FEM, NCPCM-2017, 8th-10th December, NIT Rourkela, Odisha, IOP Conf. Series: Materials Science and Engineering 338 (2018) 012035 doi:10.1088/1757-899X/338/1/012035",
    "Sharma, N., Mahapatra, T. R. and Panda, S. K., (2017) Acoustic radiation characteristics of un-baffled laminated composite conical shell panels, IConAMMA-2017, Amrita Vishwa Vidyapeetham University, Bangalore, India.",
    "Hirwani, C. K., Panda, S. K., Mandal, S. K., Mahapatra, S. S. and De, A., (2017) Dynamic behaviour of delaminated composite plate under blast loading, GTINDIA2017-4847, pp. V002T05A032; 7 pages, doi:10.1115/GTINDIA2017-4847.",
    "Katariya, P. V. and Panda, S. K., (2017) Simulation Study of Transient Responses of Laminated Composite Sandwich Plate, GTINDIA2017-4846, pp. V002T05A031; 5 pages, doi:10.1115/GTINDIA2017-4846.",
    "Katariya Pankaj, Panda S. K. and Mahapatra T. R., (2017), Effect of skew angle on free vibration responses of sandwich composite plate, AETM 2017, Bangkok, Thailand, 6th January 2017.",
    "Panda, S. K., Mahapatra, T. R. and Kar, V. R., (2017), Nonlinear Finite Element Solution of Post-buckling Responses of FGM Panel Structure under Elevated Thermal Load and TD and TID Properties International Conference on Advanced Technologies in Manufacturing and Materials Engineering 2017, January 5th-7th, Thailand (Published in SCOPUS indexed MATEC Web of Conferences 109, 05005)",
    "Hirwani, C. K., Mittal, H., Panda, S. K., Mahapatra, S. S., Mandal, S. K., De, A., (2016) Simulation Study of Stress and Deformation Behaviour of Debonded Laminated Structure-An Experimental Validation, NCPCM 2016, National Institute of Technology Rourkela, December 9-10 (2017 IOP Conf. Ser.: Mater. Sci. Eng. 178 012005) SCOPUS.",
    "Mahapatra, T. R., Mehar, K. and Panda, S. K., Dewangan, S., and Dash, S., (2016) Flexural Strength of Functionally Graded Nanotube Reinforced Sandwich Spherical Panel, NCPCM 2016, National Institute of Technology Rourkela, December 9-10, (2017 IOP Conf. Ser.: Mater. Sci. Eng. 178 012031) SCOPUS.",
    "Suman S. D., Hirwani, C. K., Chaturbedy, A., and Panda, S. K., (2016) Effect of magnetostrictive material layer on the stress and deformation behavior of laminated composite structure, NCPCM 2016, National Institute of Technology Rourkela, December 9-10 (IOP Conf. Ser.: Mater. Sci. Eng. 178 012031) SCOPUS.",
    "Mahapatra, T. R., Panda, S. K. and Dash, S, Effect of hygrothermal environment on the nonlinear free vibration responses of laminated composite plates: A nonlinear Finite element micromechanical approach. Proceedings of International Conference on Advances in Materials and Manufacturing Applications (IConAMMA-2016), 14–16 July 2016, Bangalore, India (Published in: IOP Conference Series: Materials Science and Engineering 149 012151) (SCOPUS)",
  "Singh, V. K. and Panda, S. K., (2015) Free Vibration Analysis Of Laminated Cylindrical Shell Panel Embedded With PZT, 12th Int. Conf. on Vibration Problem (ICOVP), IIT Guwahati, India, December 14-17 (Published in: Procedia Engineering, 144 (2016) 660–667 (SCOPUS))",
  "Sahoo, S. S. and Panda S. K., (2015) Experimental Free Vibration And Transient Analysis of Angle-Ply Carbon/Epoxy Laminated Plate, 12th Int. Conf. on Vibration Problem (ICOVP), IIT Guwahati, India, December 14-17.",
  "Mehar, K. and Panda, S. K., (2015), Free Vibration and Bending Behaviour of CNT Reinforced Composite Plate using Different Shear Deformation Theory, NCPCM 2015, National Institute of Technology Rourkela, December 12-13. (Published in: IOP Conference Series: Materials Science and Engineering 115 012014) (SCOPUS)",
  "Hirwani, C. K., Sahoo, S. S. and Panda, S. K., (2015) Effect of delamination on vibration behaviour of woven Glass/Epoxy composite plate-An experimental study, NCPCM 2015, National Institute of Technology Rourkela, December 12-13. (Published in: IOP Conference Series: Materials Science and Engineering 115 012010) (SCOPUS)",
  "Mahapatra, T. R. and Panda, S. K., (2015) Hygro-thermal effects on the flexural strength of laminated composite cylindrical panels, NCPCM 2015, National Institute of Technology Rourkela, December 12-13.(Published in: IOP Conference Series: Materials Science and Engineering 115 012040) (SCOPUS)",
  "Kar, V. R. and Panda, S. K., (2015) NCPCM 2015, National Institute of Technology Rourkela, December 12-13.",
  "Katariya, P. V. and Panda, S. K., (2015) Flexural Behaviour of Soft Core Skew Sandwich Plate using Higher Order Shear Deformation Theory, NCPCM 2015, National Institute of Technology Rourkela, December 12-13.",
  "Katariya, P. V., Kar, V. R. and Panda, S. K., (2015) Free Vibration Analysis of Skew Laminated Composite Curved Shell Panels, Int. Conf. on Computer Aided Engineering (CAE-2015), GITAM University, Hyderabad, India, December 10-12.",
  "Sahoo, S. S. and Panda, S. K., (2015) Flexural and Free Vibration Response of Woven Carbon/Epoxy Laminated Plate Using Higher Order Theory- Experimental, Int. Conf. on Computer Aided Engineering (CAE-2015), GITAM University, Hyderabad, India, December 10-12.",
  "Mahapatra, T. R. and Panda, S. K., (2015) Hygrothermal Free Vibration Analysis of Laminated Composite Flat Panels Using A Nonlinear Finite Element Micromechanical Model, Int. Conf. on Computer Aided Engineering (CAE-2015), GITAM University, Hyderabad, India, December 10-12.",
  "Mehar, K. and Panda, S. K., (2015) Free Vibration and Bending Behaviour of Carbon Nanotube Reinforced Composite Flat Panel in Thermal Environment, Int. Conf. on Computer Aided Engineering (CAE-2015), GITAM University, Hyderabad, India, December 10-12.",
  "Sahoo, S. S. and Panda S. K., (2014) Free vibration analysis of composite panel using HSDT, 3rd KIIT International Symposium on Advances in Automotive Technology (KIIT-SAAT 2014), KIIT University, Bhubaneswar, India, Dec 27-28.",
  "Kar, V. R. and Panda, S. K., (2014) Effect of temperature on stability behaviour of functionally graded spherical panel, NCPCM 2014 December 5th-6th, National Institute of Technology Rourkela, (Published in: IOP Conference Series: Materials Science and Engineering) DOI:10.1088/1757-899X/75/1/012014 (SCOPUS).",
  "Mahapatra, T. R. and Panda, S. K., (2014) Effects of hygrothermal conditions on free vibration behaviour of laminated composite structures, NCPCM 2014 December 5th-6th, National Institute of Technology Rourkela, (Published in: IOP Conference Series: Materials Science and Engineering) DOI: 10.1088/1757-899X/75/1/012017(SCOPUS).",
  "Sahoo, S. S. Singh, V. K. and Panda S. K., (2014) Experimental and simulation study of flexural behaviour of woven Glass/Epoxy laminated composite plate, NCPCM 2014 December 5th-6th, National Institute of Technology Rourkela, (Published in: IOP Conference Series: Materials Science and Engineering) DOI: 10.1088/1757-899X/75/1/012017 (SCOPUS).",
  "Kar, V. R., and Panda, S. K., (2014), Thermal buckling of temperature dependent functionally graded cylindrical panel, 5th International and 26th All India Manufacturing Technology Design and Research Conference (AIMTDR-00183) IIT Guwahati December 12-14.",
  "Kar, V. R., and Panda, S. K., (2014), Bending responses of functionally graded cylindrical panel, International Conference on Emerging Materials and Processes (ICEMP), CSIR- IMMT, Bhubaneswar, India on Feb 26-28.",
  "Kar, V. R., Singh, R. K., Panda, S. K., (2013), Effect of gradation on bending behaviour of functionally graded spherical panels, 4th National Conference on Processing and Characterization of Materials (NCPCM 2013), NIT, Rourkela, India, Dec 6-7.",
  "Hussain, M. A., and Panda, S. K., (2013), Effect of CNT volume fraction on bending behaviour of CNT based composite plate, 4th National Conference on Processing and Characterization of Materials (NCPCM 2013), NIT, Rourkela, India, Dec 6-7.",
  "Katariya, P. V., and Panda, S. K. (2013), Modal Analysis of Laminated Spherical Shell Panels using Finite Element Method, International Conference on Structural Engineering and Mechanics, NIT Rourkela, India on December 20-22.",
  "Kar, V. R., and Panda, S. K., (2013), Thermal Stability Analysis of Functionally Graded Panels, International Conference on Structural Engineering and Mechanics, NIT Rourkela, India on December 20-22.",
  "Kar, V. R., and Panda, S. K. (2013), Bending behaviour of functionally graded spherical shell panel, 2nd KIIT International Symposium on Advances in Automotive Technology (KIIT-SAAT 2013), KIIT University, Bhubaneswar, India, and Dec 20-21.",
  "Katariya, P. V., and Panda, S. K. (2013), Stability and vibration behaviour of laminated composite and sandwich structures, 2nd KIIT International Symposium on Advances in Automotive Technology (KIIT-SAAT 2013), KIIT University, Bhubaneswar, India, Dec 20-21.",
  "Dash, P. P., Kumar, K., Panda, S. K. (2013), Stress Analysis of Human Femur, International Conference on Computer Aided Engineering, IIT Madras, India on December 19-21.",
  "Singh, V. K., and Panda, S. K. (2013), Free Vibration and Bending Behavior of Laminated Composite Single/Doubly Curved Panels, International Conference on Computer Aided Engineering, IIT Madras, India on December 19-21.",
  "Singh, V. K., and Panda, S. K. (2013), Linear Static and Free Vibration Analysis of Laminated Composite Spherical   Shells, ASME 2013 Gas Turbine India Conference (GTINDIA2013), CSIR-NAL, Banglore, India on December 5-6. (Published in: ASME DC Conference Proceedings, Paper No. GTINDIA2013-3712, doi: 10.1115/GTINDIA2013-3712) (SCOPUS).",
  "Katariya, P. V., and Panda, S. K. (2013), Stability Analysis of Laminated Composite Panels under Thermo-Mechanical Loading, ASME 2013 Gas Turbine India Conference (GTINDIA2013), CSIR-NAL, Banglore, India on December 5-6. (Published in: ASME DC Conference Proceedings, Paper No. GTINDIA2013-3651, DOI: 10.1115/GTINDIA2013-3651) (SCOPUS).",
  "Kar, V. R., and Panda, S. K., (2013), Free Vibration Responses of Functionally Graded Spherical Shell Panels using Finite Element Method, ASME 2013 Gas Turbine India Conference (GTINDIA2013), CSIR-NAL, Bangalore, India on December 5-6. (Published in: ASME DC Conference Proceedings, Paper No. GTINDIA2013-3693, DOI: 10.1115/GTINDIA2013-3693) (SCOPUS).",
  "Sahu, G. K., and Panda, S. K. (2013), Free vibration analysis of Laminated Composite Plate with cutout, Advances in modelling and Analysis of Aerodynamic Systems (AMAAS), NIT Rourkela, Odisha, India, 1-2 March.",
  "Kar, V. R., and Panda, S. K. (2013), Free vibration response of functionally graded cylindrical shell panel using FEM, All India Seminar on Recent Advances in Mechanical Engineering, Odisha State Centre Institution of Engineers (India), Bhubaneswar, India, March 16-17.",
  "Singh, V. K., and Panda, S. K. (2013), Free vibration analysis of Laminated Composite Plates, All India Seminar on Recent Advances in Mechanical Engineering, Odisha State Centre Institution of Engineers (India), Bhubaneswar, India, March 16-17.",
  "Mohapatra, T. R. Panda, S. K., and Mishra P. K. (2012) Curvature effect on free vibration behavior laminated composite shell panel, NASOME-2012, KIIT University Bhubaneswar, February 18-19 2012.",
  "Katariya, P. V., Mahapatra, T. R., and Panda, S. K. (2013), Stability Analysis of Laminated Composite Cylindrical Shell Structure under uni-axial loading, All India Seminar on Recent Advances in Mechanical Engineering, Odisha State Centre Institution of Engineers (India), Bhubaneswar, India, March 16-17.",
  "Katariya, P. V., and Panda, S. K. (2013), Parametric Study on Free Vibration behaviour of Laminated Composite Panel, International Conference on Advances in Mechanical Engineering, College of Engineering Pune, Pune, India, May 29-31.",
  "Katariya, P. V., and Panda, S. K. (2013), Thermomechanical stability Analysis of Laminated Composite Plate Using FEM, Advance in Automotive Technology (KIIT-SAAT 2013), Vehicle Body Dynamics, KIIT University, Bhubaneswar, India, January 11-12.",
  "Sahu, G. K., and Panda, S. K. (2013), Vibration and Static Analysis of Laminated Composite Plate USING Finite Element Method, Advance in Automotive Technology (KIIT-SAAT 2013), Vehicle Body Dynamics, KIIT University, Bhubaneswar, India, January 11-12.",
  "Kar, V. R., and Panda, S. K. (2013), Scope and Study of Functionally Graded Plate Structures in Automotives, Advance in Automotive Technology (KIIT-SAAT 2013), Vehicle Body Dynamics, KIIT University, Bhubaneswar, India, January 11-12.",
  "Mishra, P. K., and Panda, S. K. (2013), Nonlinear Static Analysis of Magnetostrictive Composite Plates using ANSYS 14.0, Advance in Automotive Technology (KIIT-SAAT 2013), Vehicle Body Dynamics, KIIT University, Bhubaneswar, India, January 11-12.",
  "Panda, S. K., and Mohapatra, T. R. (2013) Nonlinear Vibration Analysis of Laminated Shells in Thermal Environments, 4th International Conference on recent Advances in Composite Material (ICRACM) IIT BHU 18 – 21 February.",
  "Panda, S. K., and Mohapatra, T. R. (2012) Geometric Nonlinear vibration Analysis of Heated Laminated Cylindrical Panel, ACUN6 –Composites and Nanocomposites in Civil, Offshore and Mining Infrastructure Melbourne 14 – 16 November.",
  "Panda, S. K., and Singh, B. N. (2010), Thermal post-buckled vibration analysis of laminated doubly curved panel using nonlinear FEM, 4th International Conference on Theoretical, Applied Computational and Experimental Mechanics (ICTACEM), IIT Kharagpur, India, December 27-29.",
  "Panda, S. K., and Singh, B. N. (2009), Post-buckling behaviour of laminated composite curved panel in thermal environment, 3rd International Congress on Computational Mechanics and Simulation (ICCMS09) at IIT-Bombay, Powai, Mumbai-400 076, India on 1-5 December.",
  "Panda, S. K., and Singh, B. N. (2009), Free Vibration Analysis Geometrically Nonlinear Laminated Composite Cylindrical Shell Panel using Nonlinear FEM, 9th Int. Conf. on Vibration Problem (ICOVP), IIT Kharagpur, India, January 19-22.",
  "Naveen, K. C., Singh, B. N., and Panda, S. K. (2008), Thermal Buckling and Post-buckling analysis of Laminated Composite Plates Embedded with and without SMA Fibers Based on Layerwise Theory using Nonlinear Finite Element Method, International Conference on Smart Materials Systems and Structures (ISSS), Bangalore, India, July 24-26.",
  "Panda, S. K., and Singh, B. N. (2007), Free Vibration Analysis Laminated Composite Plates using Higher Order Shear Deformation Theory, International Conference on Computer Aided Engineering (CAE), IIT Madras, Chennai, India, December 13-15.",
  "Panda, S. K., and Singh, B. N. (2007), Free Vibration Analysis Laminated Composite Shell Panel using Higher Order Shear Deformation Theory, 4th International Conference on Theoretical, Applied Computational and Experimental Mechanics (ICTACEM), IIT Kharagpur, India, December 27-29."
  ] 